Repository: Natkeeran/islandora_event
Catalog: translations/*.po
Languages: ta

source: Subject
ta: துறை

source: Description
ta: விபரிப்பு

source: Address
ta: முகவரி

source: Start Date
ta: தொடக்க திகதி

source: End Date
ta: முடிவுத் திகதி

source: Event Langauge
ta: நிகழ்வு மொழி

source: Organizer
ta: ஒழுங்கமைப்பாளர்

source: Participant
ta: பங்கேற்பாளர்

source: Sponsor
ta: புரவலர்

source: Temporal
ta: காலம்

source: Work Featured
ta: தொடர்புடைய வளம்

source: Reference
ta: மேற்கோள்
